app/controllers/admin/books_controller.rb

  def create
    # Either id or create new both not both
    if !params[:book][:category_id].blank?
      params[:book].delete(:category_title)
    elsif !params[:book][:category_title].blank?
      params[:book].delete(:category_id)
    else
      params[:book].delete(:category_title)
      params[:book][:category_id] = nil
    end
    if !params[:book][:subcategory_id].blank?
      params[:book].delete(:subcategory_title)
    elsif !params[:book][:subcategory_title].blank?
      params[:book].delete(:subcategory_id)
    else
      params[:book].delete(:subcategory_title)
      params[:book][:subcategory_id] = nil
    end

    @book = Book.new params[:book]
    if @book.save
---
INSERT INTO "books" ("number_of_pages", "isbn", "full_title", "publication_location", "size", "brief_description", "full_description", "modified_at", "id_number", "date", "short_title", "endline", "notes", "condition", "category_id", "publisher", "origin", "bibliography", "printer", "location_of_original", "rrs", "spare1", "submitted_by", "spare2", "modern", "subcategory_id", "created_at") VALUES('', '', 'This book is supposed to test something', '', '', 'This is the description that appears publicly.<br/>', 'This is the huge description of the book<br/>', NULL, '', '09/10/2012', 'Test Book', 'Endlinesss', '<b>WELL</b>, I guess I might as well begin to test something. Yeah?<br/>', '', NULL, 'Publisher.I.Am', '', '', '', '', '0', '', NULL, '', NULL, NULL, '2010-11-20 20:32:54')

  def search
    respond_to do |format|
      # Only do something if javascript was requested (for now)
      format.js do
        # Get books that match autocomplete terms
        books = Book.find(:all, :conditions => ['full_title LIKE ? OR short_title LIKE ?', '%' + params[:term] + '%', '%' + params[:term] + '%'], :limit => 5, :order => 'short_title ASC', :include => :authors)
---
SELECT "authors".*, t0.book_id as the_parent_record_id FROM "authors" INNER JOIN "authors_books" t0 ON "authors".id = t0.author_id WHERE (t0.book_id IN (2,3,4,5,6))
SELECT * FROM "books" WHERE (full_title LIKE '%test%' OR short_title LIKE '%test%') ORDER BY full_title ASC LIMIT 5