app/controllers/admin/categories_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 4)
INSERT INTO "languages" ("language", "words", "category_id") VALUES(NULL, NULL, 108)
---
  def edit
    @category = Category.find params[:id]
    @category.languages << Language.new

SELECT * FROM "categories" WHERE ("categories"."id" = 6)
SELECT * FROM "languages" WHERE ("languages".category_id = 7)
DELETE FROM "languages" WHERE "id" = 13
UPDATE "categories" SET "body" = '<p align="center"><i>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;The etymology of allegory is from three Greek words allos, agora and euein.&nbsp; These last two mean &lsquo;marketplace&rsquo; and &lsquo;to speak&rsquo;, and so together to speak openly or in public.&nbsp; Allos means &lsquo;other&rsquo; so the whole word combined is negative: to speak in a manner which conceals your real meaning (<a href="books1.php4#Fletcher">Fletcher</a> 2). Later Isidore of Seville in his Etymologies gives it its original Latin name &ndash; alieniloqium or other speaking.</i></p>
---
  def update
    @cat = Category.find params[:id]
    @cat.modified_at = Time.now

    # Fix language bug
    if params[:category][:languages_attributes]['0'][:language].blank? || params[:category][:languages_attributes]['0'][:words].blank?
      params[:category].delete :languages_attributes
      params[:category][:language_ids] = []
    end

    # Remove nested attribute because I did it myself
    params[:category].delete :books_attributes if params[:category].has_key? :books_attributes

    if @cat.update_attributes params[:category]

SELECT * FROM "categories" ORDER BY title ASC
INSERT INTO "categories" ("redirect_id", "title", "body", "modified_at", "authorities", "extra", "created_at") VALUES(4, 'Yoshitomo', NULL, NULL, 'Test, One, Two', NULL, '2010-11-21 20:01:40')
---
  def create
    if params[:category][:languages_attributes][0][:language].blank? || params[:category][:languages_attributes][0][:words].blank?
      params[:category].delete :languages_attributes
      params[:category][:language_ids] = []
    end
    @category = Category.new params[:category]

    if @category.save

SELECT "books".* FROM "books" WHERE ("books".category_id = 108)
SELECT * FROM "categories" WHERE ("categories"."id" = 108)
---
  def add_books
    @category = Category.find params[:id], :include => :books

SELECT * FROM "categories" WHERE ("categories"."id" = 107)
DELETE FROM "categories" WHERE "id" = 107
---
  def destroy
    @category = Category.find(params[:id])

    if @category.destroy

SELECT * FROM "categories" WHERE (title LIKE '%testing%') ORDER BY title ASC LIMIT 5
SELECT * FROM "categories" ORDER BY title ASC LIMIT 5
---
  def search
    respond_to do |format|
      format.js do
        cats = Category.find(:all, :conditions => ['title LIKE ?', '%' + params[:term] + '%'], :limit => 5, :order => 'title ASC')
        options = cats.collect {|cat| {:label => cat.title, :value => '', :id => cat.id}}