app/controllers/admin_controller.rb

  def preload
    Dir.new(RAILS_ROOT + '/yamls/').entries.each do |file|
      unless file == '.' || file == '..' || file == 'All_Categories.yml'
        category = Category.find_by_title file.split('.')[0]
        raw_data = File.read(RAILS_ROOT + '/yamls/' + file)
        collection = YAML.load(raw_data)
        collection.each do |entry|
          author_name = entry['author'].split(' ')
          author = Author.create :first_name => author_name[0], :last_name => author_name[1]
          entry['books'].each do |book|
            book_to_add = Book.create :short_title => book['title'], :date => book['Publishing Year'], :brief_description => book['description'], :publication_location => book['Publishing Location'], :publisher => book['Publisher'], :author_ids => [author.id]
---
SELECT * FROM "categories" WHERE ("categories"."title" = 'Allegories') LIMIT 1
INSERT INTO "authors" ("dates", "first_name", "last_name") VALUES(NULL, 'Johannes', 'Agricola')
INSERT INTO "books" ("number_of_pages", "isbn", "full_title", "publication_location", "size", "brief_description", "full_description", "cover_content_type", "modified_at", "id_number", "language", "date", "short_title", "endline", "notes", "condition", "category_id", "publisher", "origin", "bibliography", "cover_file_name", "printer", "location_of_original", "rrs", "spare1", "submitted_by", "spare2", "modern", "subcategory_id", "created_at") VALUES(NULL, NULL, NULL, 'London', NULL, 'First edition. A lighthearted manual containing expositions and lists of proverbs, devises, epigrams&nbsp;and other genres as they particularly concerned the British. For a copy of Gruter&rsquo;s collection of proverbs see below. <br />