app/controllers/books_controller.rb

  def index
    @category = Category.find params[:category_id], :include => :books
---
SELECT "books".* FROM "books" WHERE ("books".category_id = 5)
SELECT * FROM "categories" WHERE ("categories"."id" = 5)