app/controllers/categories_controller.rb

  def show
    @category = Category.find params[:id], :include => :redirect
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)